### Pandas Merging,Joining and Concatination
- Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labelled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can join, merge, and concat dataframe using different methods. In Dataframe df.merge(),df.join(), and df.concat() methods help in joining, merging and concating different dataframe.

#### Concatenating DataFrame
- In order to concat dataframe, we use concat() function which helps in concatenating a dataframe. We can concat a dataframe in many different ways, they are:

    - Concatenating DataFrame using .concat()
    - Concatenating DataFrame by setting logic on axes
    - Concatenating DataFrame using .append()
    - Concatenating DataFrame by ignoring indexes
    - Concatenating DataFrame with group keys
    - Concatenating with mixed ndims

We will try to cover most of the methods mentioned above


__Concatenating DataFrame using .concat() :__

In [2]:
import pandas as pd 
 
data1 = {'Name':['Mihir', 'Ginelle', 'Kartikesh', 'Sachin'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
data2 = {'Name':['Chandan', 'Tanmay', 'Sohail', 'Huzaifa'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

In [6]:
df1=pd.DataFrame(data1,index=[0,1,2,3])
df2=pd.DataFrame(data2,index=[4,5,6,7])

In [13]:
print(df1, "\n\n", df2)

        Name  Age    Address Qualification
0      Mihir   27     Nagpur           Msc
1    Ginelle   24     Kanpur            MA
2  Kartikesh   22  Allahabad           MCA
3     Sachin   32    Kannuaj           Phd

       Name  Age    Address Qualification
4  Chandan   17     Nagpur         Btech
5   Tanmay   14     Kanpur           B.A
6   Sohail   12  Allahabad          Bcom
7  Huzaifa   52    Kannuaj        B.hons

In [14]:
dataframes=[df1,df2]

In [15]:
result=pd.concat(dataframes)

In [16]:
result

        Name  Age    Address Qualification
0      Mihir   27     Nagpur           Msc
1    Ginelle   24     Kanpur            MA
2  Kartikesh   22  Allahabad           MCA
3     Sachin   32    Kannuaj           Phd
4    Chandan   17     Nagpur         Btech
5     Tanmay   14     Kanpur           B.A
6     Sohail   12  Allahabad          Bcom
7    Huzaifa   52    Kannuaj        B.hons

__Concatenating DataFrame by setting logic on axes :__
- In order to concat dataframe, we have to set different logic on axes. We can set axes in the following three ways:
    - Taking the union of them all, join='outer'. This is the default option as it results in zero information loss.
    - Taking the intersection, join='inner'.
    - Use a specific index, as passed to the join_axes argument

In [35]:
data1 = {'Name':['Mihir', 'Ginelle', 'Kartikesh', 'Sachin'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
   
data2 = {'Name':['Mihir', 'Tanmay', 'Kartikesh', 'Sohail'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df1=pd.DataFrame(data1,index=[0,1,2,3])
df2=pd.DataFrame(data2,index=[0,5,2,4])

In [40]:
result2 = pd.concat([df1, df2], axis=1, join='inner')

In [41]:
result2

,Name,Age,Address,Qualification,Name,Age,Address,Qualification
0,Mihir,27,Nagpur,Msc,Mihir,17,Nagpur,Btech
2,Kartikesh,22,Allahabad,MCA,Kartikesh,12,Allahabad,Bcom

In [42]:
result3 = pd.concat([df1, df2], axis=1, sort=False)

In [43]:
result3

,Name,Age,Address,Qualification,Name,Age,Address,Qualification
0,Mihir,27.0,Nagpur,Msc,Mihir,17.0,Nagpur,Btech
1,Ginelle,24.0,Kanpur,MA,NaN,NaN,NaN,NaN
2,Kartikesh,22.0,Allahabad,MCA,Kartikesh,12.0,Allahabad,Bcom
3,Sachin,32.0,Kannuaj,Phd,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,Sohail,52.0,Kannuaj,B.hons
5,NaN,NaN,NaN,NaN,Tanmay,14.0,Kanpur,B.A

#### Concatenating DataFrame using .append()
- In order to concat a dataframe, we use .append() function this function concatenate along axis=0, namely the index. This function exist before .concat.

In [44]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [45]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [46]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [47]:
result4=df1.append(df2)

In [48]:
result4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [53]:
result4=result4.append(df3)

In [54]:
result4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [55]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging DataFrame
- Pandas have options for high-performance in-memory merging and joining. When we need to combine very large DataFrames, joins serve as a powerful way to perform these operations swiftly. Joins can only be done on two DataFrames at a time, denoted as left and right tables. The key is the common column that the two DataFrames will be joined on. Itâ€™s a good practice to use keys which have unique values throughout the column to avoid unintended duplication of row values. Pandas provide a single function, merge(), as the entry point for all standard database join operations between DataFrame objects.
- There are four basic ways to handle the join (inner, left, right, and outer), depending on which rows must retain their data.

In [65]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Mihir', 'Sachin', 'Kartikesh', 'Rohan'], 
        'Age':[27, 24, 22, 32],} 
    
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
 
 
df1 = pd.DataFrame(data1)

df2 = pd.DataFrame(data2) 
  
print(df1," \n \n ",df2)

  key       Name  Age
0  K0      Mihir   27
1  K1     Sachin   24
2  K2  Kartikesh   22
3  K3      Rohan   32

    key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

__Now we are using .merge() with one unique key combination__

In [68]:
result = pd.merge(df1, df2, on='key')

In [69]:
result

  key       Name  Age    Address Qualification
0  K0      Mihir   27     Nagpur         Btech
1  K1     Sachin   24     Kanpur           B.A
2  K2  Kartikesh   22  Allahabad          Bcom
3  K3      Rohan   32    Kannuaj        B.hons

__Merging dataframe using multiple join keys.__

In [77]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Mihir', 'Prince', 'Sawant', 'Jigar'], 
        'Age':[27, 24, 22, 32],} 
   
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
  
df1 = pd.DataFrame(data1)
 
  
df2 = pd.DataFrame(data2) 

print(df1," \n\n ",df2)

  key key1    Name  Age
0  K0   K0   Mihir   27
1  K1   K1  Prince   24
2  K2   K0  Sawant   22
3  K3   K1   Jigar   32

    key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

In [78]:
result1 = pd.merge(df1, df2, on=['key', 'key1'])

In [79]:
result1

  key key1    Name  Age    Address Qualification
0  K0   K0   Mihir   27     Nagpur         Btech
1  K2   K0  Sawant   22  Allahabad          Bcom

### Merging dataframe using how in an argument:
- We use how argument to merge specifies how to determine which keys are to be included in the resulting table. If a key combination does not appear in either the left or right tables, the values in the joined table will be NA. Here is a summary of the how options and their SQL equivalent names:




| __Merge Method__ | __Join Name__ | __Description__ |
| :- | -: | :-: |
| left | LEFT OUTTER JOIN | Use keys from left frame only
| right | RIGHT OUTTER JOIN | Use keys from right frame only
| outter | FULL OUTTER JOIN | 	Use union of keys from both frames
| inner | INNER JOIN | 	Use intersection of keys from both frames

In [80]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Mihir', 'Prince', 'Sawant', 'Jigar'], 
        'Age':[27, 24, 22, 32],} 
   
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
  
df1 = pd.DataFrame(data1)
 
  
df2 = pd.DataFrame(data2) 

print(df1," \n\n ",df2)

  key key1    Name  Age
0  K0   K0   Mihir   27
1  K1   K1  Prince   24
2  K2   K0  Sawant   22
3  K3   K1   Jigar   32

    key key1    Address Qualification
0  K0   K0     Nagpur         Btech
1  K1   K0     Kanpur           B.A
2  K2   K0  Allahabad          Bcom
3  K3   K0    Kannuaj        B.hons

- Now we set how = 'left' in order to use keys from left frame only.

In [83]:
result_left = pd.merge(df1, df2, how='left', on=['key', 'key1'])
 
result_left

  key key1    Name  Age    Address Qualification
0  K0   K0   Mihir   27     Nagpur         Btech
1  K1   K1  Prince   24        NaN           NaN
2  K2   K0  Sawant   22  Allahabad          Bcom
3  K3   K1   Jigar   32        NaN           NaN

- Now we set how = 'right' in order to use keys from right frame only.

In [81]:
result_right = pd.merge(df1, df2, how='right', on=['key', 'key1'])
 
result_right

  key key1    Name   Age    Address Qualification
0  K0   K0   Mihir  27.0     Nagpur         Btech
1  K2   K0  Sawant  22.0  Allahabad          Bcom
2  K1   K0     NaN   NaN     Kanpur           B.A
3  K3   K0     NaN   NaN    Kannuaj        B.hons

- Now we set how = 'outer' in order to get union of keys from dataframes.

In [82]:
result_outter = pd.merge(df1, df2, how='outer', on=['key', 'key1'])
 
result_outter

  key key1    Name   Age    Address Qualification
0  K0   K0   Mihir  27.0     Nagpur         Btech
1  K1   K1  Prince  24.0        NaN           NaN
2  K2   K0  Sawant  22.0  Allahabad          Bcom
3  K3   K1   Jigar  32.0        NaN           NaN
4  K1   K0     NaN   NaN     Kanpur           B.A
5  K3   K0     NaN   NaN    Kannuaj        B.hons

- Now we set how = 'inner' in order to get intersection of keys from dataframes.

In [84]:
result_inner = pd.merge(df1, df2, how='inner', on=['key', 'key1'])
 
result_inner

  key key1    Name  Age    Address Qualification
0  K0   K0   Mihir   27     Nagpur         Btech
1  K2   K0  Sawant   22  Allahabad          Bcom

### Joining DataFrame
- In order to join dataframe, we use .join() function this function is used for combining the columns of two potentially differently-indexed DataFrames into a single result DataFrame.



__lets use .join() method in order to join dataframes__

In [4]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 
    
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
   
df1 = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])
   
df2 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])

print(df1,"  \n\n" ,df2)

      Name  Age
K0     Jai   27
K1  Princi   24
K2  Gaurav   22
K3    Anuj   32

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [5]:
result=df1.join(df2)

In [6]:
result

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

- using __how__ parameter in join

In [10]:
result2=df1.join(df2,how='outer')

In [11]:
result2

      Name   Age    Address Qualification
K0     Jai  27.0  Allahabad           MCA
K1  Princi  24.0        NaN           NaN
K2  Gaurav  22.0    Kannuaj           Phd
K3    Anuj  32.0  Allahabad          Bcom
K4     NaN   NaN    Kannuaj        B.hons

#### Joining dataframe using on in an argument :
- In order to join dataframes we use on in an argument. join() takes an optional on argument which may be a column or multiple column names, which specifies that the passed DataFrame is to be aligned on that column in the DataFrame.

In [14]:
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],
        'Key':['K0', 'K1', 'K2', 'K3']} 
    
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 

df1 = pd.DataFrame(data1)
  
df2 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])

print(df1,"  \n\n" ,df2)

     Name  Age Key
0     Jai   27  K0
1  Princi   24  K1
2  Gaurav   22  K2
3    Anuj   32  K3

       Address Qualification
K0  Allahabad           MCA
K2    Kannuaj           Phd
K3  Allahabad          Bcom
K4    Kannuaj        B.hons

In [15]:
result3=df1.join(df2,on='Key')

In [16]:
result3

     Name  Age Key    Address Qualification
0     Jai   27  K0  Allahabad           MCA
1  Princi   24  K1        NaN           NaN
2  Gaurav   22  K2    Kannuaj           Phd
3    Anuj   32  K3  Allahabad          Bcom

### Operations

- There are lots of operations with pandas that will be really useful to you while working on data science!

In [17]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Info on Unique Values

In [18]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [19]:
df['col2'].nunique()

3

In [20]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Selecting Data

- Select from DataFrame using criteria from multiple columns

In [21]:
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [22]:
newdf

   col1  col2 col3
3     4   444  xyz

#### Applying Functions

In [23]:
def times2(x):
    return x*2

In [24]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [25]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [26]:
df['col1'].sum()

10

- Permanently Removing a Column

In [27]:
del df['col1']

In [28]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

- Get column and index names:

In [29]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [30]:
df.index

RangeIndex(start=0, stop=4, step=1)

- Sorting and Ordering a DataFrame:

In [31]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [32]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [33]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [34]:
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

- Filling in NaN values with something else:

In [36]:
import numpy as np

In [37]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [38]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

#### Pivot Table

In [39]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [40]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN